Documents/КурсовыеРазницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>КурсовыеРазницы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПрогноз</Name>
					<Comment>означает, что этот документ - планируемый, т.е.вместо него будет введе другой документ, не обязательно с такими же параметрами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВСбережениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДРСбер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>сумма в валюте кошелька</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогноз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогнозРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>флВнутреннее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/КурсовыеРазницы/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//регистр ДенежныеСредства 
	НаборЗаписей = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.ВидДвижения = ?(Сумма<0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	
	НоваяЗапись.Период = Дата;
	НоваяЗапись.Регистратор = Ссылка;
	НоваяЗапись.Кошелек = Кошелек;
	
	Если Не ЭтоПрогноз Тогда
		НоваяЗапись.СуммаРегл = Сумма*?(Сумма<0,-1,1);
	Иначе
		НоваяЗапись.СуммаПрогнозРегл = Сумма*?(Сумма<0,-1,1);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	//регистр БДР
	Если Бюджет Тогда
		Контрагент=Неопределено;
		Номенклатура=Неопределено;
		ОбщийМодуль1Сервер.ДвижениеБДРФакт(движения.бдр, СтатьяДР, Сумма*?(Сумма<0,-1,1), Дата, Номенклатура, Контрагент, Проект, ЭтоПрогноз);
	КонецЕсли;
	
	//регистр Сбережения
	
	Если ОтразитьВСбережениях Тогда
		НаборЗаписей = РегистрыНакопления.Сбережения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ВидДвижения = ?(Сумма<0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.Кошелек = Кошелек;
		
		Если Не ЭтоПрогноз Тогда
			НоваяЗапись.СуммаРегл = Сумма*?(Сумма<0,-1,1);
		Иначе
			//20 03 14 пока так, потому что ресурса для прогноза в регистре нет за ненадобностью, можеть быть потом добавлю
			//НоваяЗапись.СуммаПрогнозРегл = Сумма*?(Сумма<0,-1,1);
			НоваяЗапись.СуммаРегл = Сумма*?(Сумма<0,-1,1);
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
			КонецЕсли;
	
КонецПроцедуры
